In [3]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings("ignore")

In [7]:
df = pd.read_csv("C:/Users/91918/OneDrive/Desktop/SUDHEERA/DataScience with Gen Ai/Course4-Numpy python/sprint4//DS1_C4_S4_Test_Scores_Data_Practice.csv")
df

,school,school_setting,school_type,classroom,teaching_method,student_id,gender,tuitionfee_waiver,test1,test2
0,ANKYI,Urban,Non-public,6OL,Standard,2FHT3,Female,Does not qualify,62.0,72.0
1,ANKYI,Urban,Non-public,6OL,Standard,3JIVH,Female,Does not qualify,66.0,79.0
2,ANKYI,Urban,Non-public,6OL,Standard,3XOWE,Male,Does not qualify,64.0,76.0
3,ANKYI,Urban,Non-public,6OL,Standard,556O0,Female,Does not qualify,61.0,77.0
4,ANKYI,Urban,Non-public,6OL,Standard,74LOE,Male,Does not qualify,64.0,76.0
...,...,...,...,...,...,...,...,...,...,...
2128,ZOWMK,Urban,Public,ZBH,Standard,T8LSK,Female,Does not qualify,39.0,55.0
2129,ZOWMK,Urban,Public,ZBH,Standard,VNP26,Female,Qualifies for reduced/free,38.0,46.0
2130,ZOWMK,Urban,Public,ZBH,Standard,YDR1Z,Female,Qualifies for reduced/free,45.0,51.0
2131,ZOWMK,Urban,Public,ZBH,Standard,YUEIH,Male,Qualifies for reduced/free,46.0,53.0
2132,ZOWMK,Urban,Public,ZBH,Standard,ZVCQ8,Male,Qualifies for reduced/free,41.0,48.0

In [ ]:
#TAsk1:
print("Before missing values result")
missing_values = df.isnull().sum()  #check for missing values
print(missing_values)
df['gender'].value_counts()
df['gender'] = df['gender'].fillna('Female')
mean_test1 = df['test1'].mean()#calculate mean of test1 scores
df['test1'].fillna(mean_test1, inplace=True) #replacing the missing values with mean in test1
median_test2 = df['test2'].median #calculate median of test2 scores
df['test2'].fillna(median_test2,inplace=True)#replacing the missing values with median in test1

print("After verfying the missing values treated")
missing_values_after = df.isnull().sum()# Verify that missing values are treated
print("Missing values after treatment:\n", missing_values_after)

Before missing values result
school               0
school_setting       0
school_type          0
classroom            0
teaching_method      0
student_id           0
gender               0
tuitionfee_waiver    0
test1                0
test2                0
dtype: int64
After verfying the missing values treated
Missing values after treatment:
 school               0
school_setting       0
school_type          0
classroom            0
teaching_method      0
student_id           0
gender               0
tuitionfee_waiver    0
test1                0
test2                0
dtype: int64

In [9]:
#Task2:
duplicates = df[df.duplicated()]
print("Duplicate rows:")
print(duplicates)
df_cleaned = df.drop_duplicates()

# Verify that duplicates have been removed
print("Data after removing duplicates:")
print(df_cleaned)

Duplicate rows:
Empty DataFrame
Columns: [school, school_setting, school_type, classroom, teaching_method, student_id, gender, tuitionfee_waiver, test1, test2]
Index: []
Data after removing duplicates:
     school school_setting school_type classroom teaching_method student_id  \
0     ANKYI          Urban  Non-public       6OL        Standard      2FHT3
1     ANKYI          Urban  Non-public       6OL        Standard      3JIVH
2     ANKYI          Urban  Non-public       6OL        Standard      3XOWE
3     ANKYI          Urban  Non-public       6OL        Standard      556O0
4     ANKYI          Urban  Non-public       6OL        Standard      74LOE
...     ...            ...         ...       ...             ...        ...
2128  ZOWMK          Urban      Public       ZBH        Standard      T8LSK
2129  ZOWMK          Urban      Public       ZBH        Standard      VNP26
2130  ZOWMK          Urban      Public       ZBH        Standard      YDR1Z
2131  ZOWMK          Urban      Public       ZBH        Standard      YUEIH
2132  ZOWMK          Urban      Public       ZBH        Standard      ZVCQ8

      gender            tuitionfee_waiver  test1  test2
0     Female             Does not qualify   62.0   72.0
1     Female             Does not qualify   66.0   79.0
2       Male             Does not qualify   64.0   76.0
3     Female             Does not qualify   61.0   77.0
4       Male             Does not qualify   64.0   76.0
...      ...                          ...    ...    ...
2128  Female             Does not qualify   39.0   55.0
2129  Female  Qualifies for reduced/free    38.0   46.0
2130  Female  Qualifies for reduced/free    45.0   51.0
2131    Male  Qualifies for reduced/free    46.0   53.0
2132    Male  Qualifies for reduced/free    41.0   48.0

[2133 rows x 10 columns]

In [11]:
#Task3:
df['tuitionfee_waiver'] = df['tuitionfee_waiver'].replace({'Does not qualify': 'No','Qualifies for reduced/free': 'Yes'})

print("Updated 'tuitionfee_waiver' column:")
print(df['tuitionfee_waiver'].value_counts())

# Verify the values have been replaced
print("Sample data from 'tuitionfee_waiver' column:")
print(df[['tuitionfee_waiver']].head())

Updated 'tuitionfee_waiver' column:
tuitionfee_waiver
No                             1215
Qualifies for reduced/free      918
Name: count, dtype: int64
Sample data from 'tuitionfee_waiver' column:
  tuitionfee_waiver
0                No
1                No
2                No
3                No
4                No

In [ ]:
#Task4:
# Group by 'school' and calculate the average of 'test1' scores
average_test1_scores = df.groupby('school')['test1'].mean()

# Display the average test1 scores for each school
print("Average 'test1' scores for each school:")
print(average_test1_scores)

# Find the school with the highest average test1 score
school_with_highest_avg = average_test1_scores.idxmax()
highest_avg_score = average_test1_scores.max()

# Display the name of the school with the highest average test1 score and the score
print("\nSchool with the highest average 'test1' score:")
print(f"School: {school_with_highest_avg}, Average Test1 Score: {highest_avg_score:.2f}")

Average 'test1' scores for each school:
school
ANKYI    61.341463
CCAAW    64.623853
CIMBB    65.067568
CUQAM    53.925234
DNQDD    54.327869
FBUMG    62.891304
GJJHK    53.194915
GOKXL    50.796875
GOOBU    38.354190
IDGFP    75.202128
KFZMY    41.865385
KZKKE    37.261261
LAYPA    62.035088
OJOBU    56.197531
QOQTS    52.543369
UAGPU    62.390805
UKPGS    78.453125
UUUQX    67.106690
VHDHF    52.666667
VKWQH    52.060000
VVTVA    36.122473
ZMNYA    68.130435
ZOWMK    41.572650
Name: test1, dtype: float64

School with the highest average 'test1' score:
School: UKPGS, Average Test1 Score: 78.45

In [13]:
#Task5:
print("Data types:")
print(df.dtypes)
print("\nFirst few rows of 'test2':")
print(df['test2'].head())

# Convert 'test2' to numeric, forcing errors to NaN
df['test2'] = pd.to_numeric(df['test2'], errors='coerce')

# Check for any NaN values after conversion
print("\nNaN values in 'test2':")
print(df['test2'].isna().sum())

# Create a pivot table to find the highest 'test2' score for each school
pivot_table = pd.pivot_table(df, values='test2', index='school', aggfunc='max')

# Display the highest test2 score for each school
print("\nHighest 'test2' score for each school:")
print(pivot_table)

# Find the top 5 schools based on the highest 'test2' scores
top_5_schools = pivot_table.nlargest(5, 'test2')

# Display the top 5 schools with the highest 'test2' scores
print("\nTop 5 schools based on highest 'test2' scores:")
print(top_5_schools)

Data types:
school                object
school_setting        object
school_type           object
classroom             object
teaching_method       object
student_id            object
gender                object
tuitionfee_waiver     object
test1                float64
test2                float64
dtype: object

First few rows of 'test2':
0    72.0
1    79.0
2    76.0
3    77.0
4    76.0
Name: test2, dtype: float64

NaN values in 'test2':
4

Highest 'test2' score for each school:
        test2
school
ANKYI    79.0
CCAAW    91.0
CIMBB    88.0
CUQAM    76.0
DNQDD    79.0
FBUMG    88.0
GJJHK    85.0
GOKXL    77.0
GOOBU    64.0
IDGFP   100.0
KFZMY    67.0
KZKKE    62.0
LAYPA    84.0
OJOBU    84.0
QOQTS    85.0
UAGPU    83.0
UKPGS    99.0
UUUQX    91.0
VHDHF    77.0
VKWQH    82.0
VVTVA    62.0
ZMNYA    95.0
ZOWMK    63.0

Top 5 schools based on highest 'test2' scores:
        test2
school
IDGFP   100.0
UKPGS    99.0
ZMNYA    95.0
CCAAW    91.0
UUUQX    91.0

In [15]:
#task6:
# Filter students from 'FBUMG', in class '5LQ', with test2 >= 80
filtered_students = df[(df['school'] == 'FBUMG') & (df['classroom'] == '5LQ') & (df['test2'] >= 80)]

# Create a series with the scholarship amount
scholarship_amount = pd.Series([500] * len(filtered_students), index=filtered_students.index, name='scholarship')

# Concatenate the new column to the DataFrame
filtered_students = pd.concat([filtered_students, scholarship_amount], axis=1)

# Display the relevant information along with student_ID and scholarship amounts
print("Students eligible for scholarship:")
print(filtered_students[['student_id', 'scholarship']])

Students eligible for scholarship:
    student_id  scholarship
467      04DG5          500
468      20M2D          500
469      39KCW          500
470      5Z1B6          500
471      6TLU8          500
472      ATQQJ          500
474      B9FSU          500
475      EV13K          500
476      I5H37          500
477      JC5I9          500
478      JPE2J          500
479      MFBYU          500
480      O144X          500
481      OGKP3          500
484      YRN9S          500

In [17]:
#Task7:
# Create a cross-table of teaching method counts by school setting
cross_tab = pd.crosstab(df['school_setting'], df['teaching_method'])

print("Count of each teaching method segregated by school setting:")# Display the cross-table
print(cross_tab)

Count of each teaching method segregated by school setting:
teaching_method  Experimental  Standard
school_setting
Rural                     201       309
Suburban                  284       433
Urban                     275       631

In [19]:
#Task8:
gender_wise_count =df.groupby(by=['school_setting','gender'])['gender'].count()
gender_wise_count

school_setting  gender
Rural           Female    228
                Male      279
Suburban        Female    368
                Male      348
Urban           Female    456
                Male      444
Name: gender, dtype: int64

In [21]:
#Task9:
result = df.groupby(['school_setting', 'gender'])['test2'].mean().reset_index()

# Display the result
print(result)

  school_setting  gender      test2
0          Rural  Female  63.973568
1          Rural    Male  64.032258
2       Suburban  Female  76.049046
3       Suburban    Male  75.942529
4          Urban  Female  61.149780
5          Urban    Male  62.421171